_posts/2013-06-05-storm-foundation.html
---
category: computer science and enginneering
layout: post
title: "the Foundation of Storm"
tags: ["Big data", "Storm"]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">宏定义</h2>
<div class="outline-text-2" id="text-1">
<p>
storm 使用clojure DSL来定义各种宏，如defserverfn,defbolt,defspout, 然后使用这些宏来定义不同的服务，bolt和spout。
</p>

<div class="org-src-container">

<pre class="src src-java">## defserverfn

        (<span style="color: #81a2be;">defmacro</span> <span style="color: #f0c674;">defserverfn</span> [name &amp; body]
                `(let [exec-fn# (fn ~<span style="color: #81a2be;">@body</span>)]
                        (defn ~name [&amp; args#]
                                (<span style="color: #b5bd68;">try</span>-cause
                                        (<span style="color: #81a2be;">apply</span> <span style="color: #f0c674;">exec</span>-fn# args#)
                                                (<span style="color: #b5bd68;">catch</span> InterruptedException e#
                                                        (<span style="color: #b5bd68;">throw</span> e#))
                                                (<span style="color: #b5bd68;">catch</span> Throwable t#
                                                        (log-error t# <span style="color: #8abeb7;">"Error on initialization of server "</span> ~(<span style="color: #81a2be;">str</span> <span style="color: #f0c674;">name</span>))
                                                                (halt-process<span style="color: #81a2be;">!</span> 13 <span style="color: #8abeb7;">"Error on initialization"</span>)
                                                        )))))
</pre>
</div>



<ul class="org-ul">
<li>分析：
</li>
</ul>
<p>
通常，在不同服务中，变化的是服务名称和处理函数组成，defserverfn接收用户的名称和处理程序，最后定义成一个带有异常处理逻辑(用户不必关心这些，并且通常都是一样
的逻辑，将这些逻辑定义在宏里，使得代码结构更加简洁)的服务处理程序，[name &amp; body] 就是用于这一目的，为了服务处理程序能接收参数，定义了 [&amp; args] , 最后，用macroexpand，来看一个例子：
</p>
<div class="org-src-container">

<pre class="src src-java">   (macroexpand <span style="color: #cc6666; font-weight: bold;">'</span><span style="color: #8abeb7;">(defserverfn service-handler [conf inimbus]</span>
<span style="color: #8abeb7;">           (.prepare inimbus conf (master-inimbus-dir conf))</span>
<span style="color: #8abeb7;">                   (log-message "Starting Nimbus with conf " conf)</span>
<span style="color: #8abeb7;">                           (let [nimbus (nimbus-data conf inimbus)]</span>
<span style="color: #8abeb7;">                                   (cleanup-corrupt-topologies! nimbus)</span>
<span style="color: #8abeb7;">                                           (doseq [storm-id (.active-storms (:storm-cluster-state nimbus))]</span>
<span style="color: #8abeb7;">                                                   (transition! nimbus storm-id :startup))</span>
<span style="color: #8abeb7;">                                                           (schedule-recurring (:timer nimbus)</span>
<span style="color: #8abeb7;">                                                                   0</span>
<span style="color: #8abeb7;">                                                                           (conf NIMBUS-MONITOR-FREQ-SECS)</span>
<span style="color: #8abeb7;">                                                                                   (fn []</span>
<span style="color: #8abeb7;">                                                                                           (when (conf NIMBUS-REASSIGN)</span>
<span style="color: #8abeb7;">                                                                                                   (locking (:submit-lock nimbus)</span>
<span style="color: #8abeb7;">                                                                                                           (mk-assignments nimbus)))</span>
<span style="color: #8abeb7;">                                                                                                                   (do-cleanup nimbus)</span>
<span style="color: #8abeb7;">                                                                                                           ))</span>
<span style="color: #8abeb7;">                                                                                                   ;; Schedule Nimbus inbox cleaner</span>
<span style="color: #8abeb7;">                                                                                                           (schedule-recurring (:timer nimbus)</span>
<span style="color: #8abeb7;">                                                                                                                   0</span>
<span style="color: #8abeb7;">                                                                                                                           (conf NIMBUS-CLEANUP-INBOX-FREQ-SECS)</span>
<span style="color: #8abeb7;">                                                                                                                                   (fn []</span>
<span style="color: #8abeb7;">                                                                                                                                           (clean-inbox (inbox nimbus) (conf NIMBUS-INBOX-JAR-EXPIRATION-SECS))</span>
<span style="color: #8abeb7;">                                                                                                                                           )))))</span>

<span style="color: #8abeb7;">(let* [exec-fn__1559__auto__ (clojure.core/fn [conf inimbus]</span>
<span style="color: #8abeb7;">    (.prepare inimbus conf (master-inimbus-dir conf)) </span>
<span style="color: #8abeb7;">    (log-message "Starting Nimbus with conf " conf) </span>
<span style="color: #8abeb7;">    (let [nimbus (nimbus-data conf inimbus)]</span>
<span style="color: #8abeb7;">    (cleanup-corrupt-topologies! nimbus) </span>
<span style="color: #8abeb7;">    (doseq [storm-id (.active-storms (:storm-cluster-state nimbus))] </span>
<span style="color: #8abeb7;">    (transition! nimbus storm-id :startup)) (schedule-recurring</span>
<span style="color: #8abeb7;">    (:timer nimbus) 0 (conf NIMBUS-MONITOR-FREQ-SECS) </span>
<span style="color: #8abeb7;">    (fn [] (when (conf NIMBUS-REASSIGN) (locking (:submit-lock</span>
<span style="color: #8abeb7;">    nimbus) </span>
<span style="color: #8abeb7;">    (mk-assignments nimbus))) (do-cleanup nimbus)))</span>
<span style="color: #8abeb7;">    (schedule-recurring (:timer nimbus) 0 </span>
<span style="color: #8abeb7;">    (conf NIMBUS-CLEANUP-INBOX-FREQ-SECS) (fn [] (clean-inbox (inbox</span>
<span style="color: #8abeb7;">    nimbus) </span>
<span style="color: #8abeb7;">    (conf NIMBUS-INBOX-JAR-EXPIRATION-SECS))))))] </span>
<span style="color: #8abeb7;">    (clojure.core/defn service-handler [&amp; args__1560__auto__] </span>
<span style="color: #8abeb7;">    (backtype.storm.util/try-cause (clojure.core/apply</span>
<span style="color: #8abeb7;">    exec-fn__1559__auto__ args__1560__auto__) </span>
<span style="color: #8abeb7;">    (catch java.lang.InterruptedException e__1561__auto__ (throw</span>
<span style="color: #8abeb7;">    e__1561__auto__)) </span>
<span style="color: #8abeb7;">    (catch java.lang.Throwable t__1562__auto__</span>
<span style="color: #8abeb7;">    (backtype.storm.log/log-error t__1562__auto__ </span>
<span style="color: #8abeb7;">    "Error on initialization of server " "service-handler") </span>
<span style="color: #8abeb7;">    (backtype.storm.util/halt-process! 13 "Error on initialization")))))</span>
</pre>
</div>
<p>
从展开结果可以看出，service-handler得到一个类似于
</p>
<div class="org-src-container">

<pre class="src src-java">(let [...] (defn ...))
</pre>
</div>
<p>
的语句，因此最后返回的是一个server-handle函数，调用该函数时，要求输入
参数(注意*args__1560__auto__*)。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">如何在nrepl下调用storm的clojure定义</h2>
<div class="outline-text-2" id="text-2">
<p>
在emacs的shell下，进入storm的project.clj, 所在的根目录，该目录包含src，
使用M-x nrepl-jack-in，打开repl-server，在提示符下导入需要的定义文件，
比如，想要得到defserverfn定义。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span>
/study/doctor/cloudstorage/stream-process/storm/storm-source3/storm
[abelard@localhost storm]$ ls
bin          classes  LICENSE.html  NOTICE    pom.xml         project.clj      src                    stormlib  test
CHANGELOG.md  conf     logback       nrepl.el  <span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">project.clj#  README.markdown  storm-0.9.0-wip16.zip  target    TODO</span>

user&gt; (use <span style="color: #8abeb7;">'[backtype.storm.daemon.common])</span>
</pre>
</div>
<p>
就可以使用common中的定义了
</p>
</div>
</div>
